Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: By default, they are discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc.auth-server-url`.
zh_cn: 默认情况下，它们是通过在配置的 `quarkus.oidc.auth-server-url` 中，添加一个 `/.well-known/openid-configuration` 路径来发现的。

source: By default, when building a native executable, GraalVM will not include any of the resources that are on the classpath into the native executable it creates. Resources that are meant to be part of the native executable need to be configured explicitly.
zh_cn: 默认情况下，在构建本地可执行文件时，GraalVM不会将classpath上的任何资源纳入其创建的原生可执行文件。要成为原生可执行文件一部分的资源，需要明确地进行配置。

source: By externalizing authorization from your application, you are allowed to protect your applications using different access control mechanisms as well as avoid re-deploying your application every time your security requirements change, where Keycloak will be acting as a centralized authorization service from where your protected resources and their associated permissions are managed.
zh_cn: 通过将授权功能从您的应用程序中抽离并外部化，您可以使用不同的访问控制机制来保护您的应用程序，也可以避免在您的安全控制需求发生变化时重新部署您的应用程序。Keycloak将作为一个集中的授权服务，它允许您的受保护资源和它们的相关权限在它这里得到管理。

source: By far the easiest way to create a container-image from your Quarkus application is to leverage one of the container-image extensions.
zh_cn: 到目前为止，从你的Quarkus应用程序中创建一个容器镜像的最简单方法是利用容器镜像扩展。

source: By itself this will not disable the tcp socket which by default will open on `0.0.0.0:8080`. It can be explicitly disabled:
zh_cn: 就其本身而言，这不会禁用默认情况下将在 0.0.0.0:8080 上打开的 tcp socket（套接字）。可以明确禁用它：

source: By simply annotating any test in the test suite with `@QuarkusTestResource`, Quarkus will run the corresponding `QuarkusTestResourceLifecycleManager` before any tests are run. A test suite is also free to utilize multiple `@QuarkusTestResource` annotations, in which case all the corresponding `QuarkusTestResourceLifecycleManager` objects will be run before the tests. When using multiple test resources they can be started concurrently. For that you need to set `@QuarkusTestResource(parallel = true)`.
zh_cn: 通过简单地在测试套件中用 `@QuarkusTestResource` 注释测试，Quarkus将在测试运行之前运行相应的 `QuarkusTestResourceLifecycleManager` 。测试套件也可以自由地利用多个 `@QuarkusTestResource` 注释，从而使所有对应的 `QuarkusTestResourceLifecycleManager` 对象在测试前运行。当使用多个测试资源时，它们可以并行启动。为此，您需要设置 `@QuarkusTestResource(parallel = true)` 。

source: By using a Bson `Codec`, the MongoDB Client will take care of the transformation of your domain object to/from a MongoDB `Document` automatically.
zh_cn: 通过使用Bson `Codec` ，MongoDB 客户端将自动处理您的域对象与 MongoDB `Document` 的相互转化。

source: By using the `QuarkusTest` runner, you instruct JUnit to start the application before the tests.
zh_cn: 通过使用 `QuarkusTest` runner，你指示JUnit在测试前启动应用程序。

source: CDI @Inject with Kotlin
zh_cn: 使用Kotlin的CDI @Inject

source: CDI `@Alternative` mechanism.
zh_cn: CDI `@Alternative` 机制。

source: CONFIGURATION
zh_cn: 配置

source: CONTRIBUTORS
zh_cn: 贡献者

source: Cache your application data
zh_cn: 缓存你的应用程序数据

source: Call `native-image` with the content of file `native-image.args` as arguments. We also supply an additional argument to limit the process's maximum memory to 4 Gigabytes (this may vary depending on the project being built and the machine building it).
zh_cn: 以文件 `native-image.args` 的内容为参数调用 `native-image` 。我们还提供了一个额外的参数，将进程的最大内存限制在4G字节（这可能取决于正在构建的项目和构建它的机器）。

source: Can I write an extension?
zh_cn: 我可以写一个扩展吗?

source: Capabilities
zh_cn: 功能

source: Category
zh_cn: 类别

source: Category: Web
zh_cn: 类别：Web

source: Centralized Log Management
zh_cn: 集中的日志管理

source: Change into the project directory:
zh_cn: 切换到工程目录：

source: Changing the configuration file is immediately reflected.
zh_cn: 更改配置文件的内容将会立即得到反馈。

source: Changing the test port
zh_cn: 改变测试端口

source: Channels are connected to message backends using *connectors*. Connectors are configured to map incoming messages to a specific channel (consumed by the application) and collect outgoing messages sent to a specific channel. Each connector is dedicated to a specific messaging technology. For example, the connector dealing with Kafka is named `smallrye-kafka`.
zh_cn: Channels 通过 *connectors* 连接到消息后端。Connectors通过配置将传入的消息映射到一个指定channel上(该channel由应用程序来消费)，并对发送到指定channel的消息进行收集。每个connector都专用于某种特定的消息传递技术。例如，与Kafka交互的的connector被命名为 `smallrye-kafka` 。

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
zh_cn: 或在 <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream) 聊天室发问。

source: Chat using <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream)
zh_cn: 或在 <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream) 聊天室发问。

source: Check <<jackson-serialization>> for more detail about the usage of Jackson with Kafka. You can also use Avro.
zh_cn: 请参看 link:#jackson-serialization[[jackson序列化]]，了解更多关于Jackson与Kafka的使用细节。您也可以使用Avro。

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
zh_cn: 请查看我们的<a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a>，了解有关报告问题和提交合并请求流程的详细信息。

source: Check out our <a href="https://github.com/quarkusio/quarkus/discussions">GitHub Discussions</a> collaboration area to interact with other Quarkus users and developers.
zh_cn: 请查看我们的<a href="https://github.com/quarkusio/quarkus/discussions">GitHub讨论</a>协作区，与其他Quarkus用户和开发人员进行互动。

source: Check out these applicable guides:
zh_cn: 请查看这些适用的指南：

source: Check the HTTP response status code and content
zh_cn: 检查HTTP回应状态代码和内容

source: Checking Permissions Programmatically
zh_cn: 以编程方式检查权限

source: Choose Your Lambda
zh_cn: 选择你的Lambda

source: Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms
zh_cn: 在OpenID Connect、SmallRye JWT和OAuth2扩展之间做出选择

source: Choosing your build tool
zh_cn: 选择您的构建工具

source: Circuit Breaker
zh_cn: 熔断器

source: Class Loading Reference
zh_cn: 类加载参考

source: Click on https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=resteasy-reactive-jackson&e=vertx[this link] to configure your application. It selected a few extensions:
zh_cn: 点击 link:https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=resteasy-reactive-jackson&e=vertx[这个链接] 来配置你的应用程序。它选择了几个扩展:

source: Click on the `Generate your application` button, download the zip file and unzip it. Then, open the project in your favorite IDE.
zh_cn: 点击 `生成你的应用程序` 按钮，下载压缩文件并解压。然后，在你喜欢的编辑器中打开该项目。

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
zh_cn: 克隆 Git 仓库可使用命令： `git clone {quickstarts-clone-url}` ，或者下载 {quickstarts-archive-url}[压缩包] 。

source: Clone the git repository: `git clone {quickstarts-clone-url}`, or
zh_cn: 克隆git存储库。 `git clone {quickstarts-clone-url}` ，或

source: Closed-Source
zh_cn: 闭源

source: Cloud
zh_cn: 云

source: Code and Issue Tracker
zh_cn: 代码和问题跟踪

source: Collecting Metrics with Micrometer
zh_cn: 用Micrometer收集指标

source: Collecting Metrics with SmallRye Metrics
zh_cn: 用SmallRye Metrics收集指标

source: Combine both the familiar imperative code and the reactive style when developing applications.
zh_cn: 在开发应用程序时，将熟悉的指令式和响应式代码风格结合起来。

source: Combining HTTP and the event bus
zh_cn: 结合HTTP和事件总线

source: Combining authentication mechanisms
zh_cn: 组合认证机制

source: Comma separated list of the audiences that a token `aud` claim may contain.
zh_cn: 逗号分隔的列表，其中列出了一个令牌的 `aud` 声明可能包含的受众。

source: Comma separated list of the audiences that a token `aud` claim may contain. This property is deprecated - use `mp.jwt.verify.audiences`.
zh_cn: 逗号分隔的列表，列出了令牌 `aud` 声明可能包含的受众。该属性已被废弃—请使用 `mp.jwt.verify.audiences` 。

source: Comma separated list of the claims that a token must contain.
zh_cn: 一个token必须包含逗号分隔的声明(claims)列表。

source: Comma-separated list containing an alternative single or multiple schemes, for example, `DPoP`.
zh_cn: 逗号分隔的列表，其中包含一个可替代的单一或多个schemes，例如， `DPoP` 。

source: Command Line Applications
zh_cn: 命令行应用

source: Command Line Interface
zh_cn: 命令行界面

source: Command Mode Reference
zh_cn: 命令模式参考

source: Commands may also be stacked:
zh_cn: 命令也可以是叠加的：

source: Comments
zh_cn: 备注

source: Commit Strategies
zh_cn: 提交策略(Commit Strategies)

source: Committing every offset has performance penalties as Kafka offset management can be slow. However, not committing the offset often enough may lead to message duplication if the application crashes between two commits.
zh_cn: 由于Kafka的偏移量管理可能很慢，所以每次提交偏移量都会有性能上的损失。然而，如果程序在两次提交之间崩溃，不够频繁的偏移量提交可能会导致消息出现重复提交。

source: Community and Standards
zh_cn: 社区和标准

source: Compatibility
zh_cn: 兼容

source: Compatible with Quarkus
zh_cn: 与Quarkus兼容

source: Compilation will take a bit longer, so this step is disabled by default; let's build again by enabling the `native` profile:
zh_cn: 编译会花一点时间，所以这一步默认是禁用的；让我们通过启用 `native` profile来再次构建：

source: Compiling a native executable takes a bit longer, as GraalVM performs additional steps to remove unnecessary codepaths. Use the `native` profile to compile a native executable:
zh_cn: 编译一个本地可执行文件需要很长的时间，因为GraalVM会执行额外的步骤来删除不必要的代码路径。可使用 `native` profile来编译一个本地可执行文件：

source: Compiling fully static binaries is done by statically linking https://musl.libc.org/[musl] instead of `glibc` and should not be used in production without rigorous testing.
zh_cn: 编译纯静态的二进制文件是通过静态链接 link:https://musl.libc.org/[musl] 而不是 `glibc` ，如果没有严格的测试，不应该在生产中使用。

source: Compiling the application to a native executable
zh_cn: 将应用程序编译为原生可执行文件

source: Components
zh_cn: 组件

source: Compress Native Executables with UPX
zh_cn: 用UPX压缩原生可执行文件

source: Conclusion
zh_cn: 解决方案

source: Conditional Extension Dependencies
zh_cn: 条件性扩展的依赖性

source: Config autocompletion
zh_cn: 配置自动补全

source: Config editor
zh_cn: 自定义向导

source: Config jump to definition
zh_cn: 配置跳转定义

source: Config outline
zh_cn: 配置大纲

source: Config profiles
zh_cn: 配置Profile

source: Config property allows for an external or internal location of Private Decryption Key to be specified.
zh_cn: 配置属性允许指定私人解密密钥的外部或内部位置。

source: Config property allows for an external or internal location of Private Decryption Key to be specified. This property is deprecated - use 'mp.jwt.decrypt.key.location'.
zh_cn: 配置属性允许指定私人解密密钥的外部或内部位置。此属性已被废弃 - 请使用 `mp.jwt.decrypt.key.location` 。

source: Config property allows for an external or internal location of Public Key to be specified. The value may be a relative path or a URL. If the value points to an HTTPS based JWK set then, for it to work in native mode, the `quarkus.ssl.native` property must also be set to `true`, see xref:native-and-ssl.adoc[Using SSL With Native Executables] for more details.
zh_cn: 配置属性允许指定公钥的外部或内部位置。该值可以是一个相对路径或一个URL。如果该值指向一个基于HTTPS的JWK集，那么为了让它在本地模式下工作， `quarkus.ssl.native` 属性也必须被设置为 `true` ，更多细节请参见 link:native-and-ssl.html[使用SSL与本地可执行程序] 。

source: Config property specifies the value of the `iss` (issuer) claim of the JWT that the server will accept as valid.
zh_cn: 配置属性指定了服务器将接受为有效的JWT的 `iss` （签发者）声明的值。

source: Config validation
zh_cn: 配置验证

source: Configuration Metadata
zh_cn: 配置元数据

source: Configuration Properties to Deny access
zh_cn: 拒绝访问的配置属性

source: Configuration Reference
zh_cn: 配置参考

source: Configuration authorization checks are executed before any annotation-based authorization check is done, so both checks have to pass for a request to be allowed. This means you cannot use `@PermitAll` to open up a path if the path has been blocked using `quarkus.http.auth.` configuration. If you are using JAX-RS you may want to consider using the `quarkus.security.jaxrs.deny-unannotated-endpoints` or `quarkus.security.jaxrs.default-roles-allowed` to set default security requirements instead of HTTP path level matching, as these properties can be overridden by annotations on an individual endpoint.
zh_cn: 配置授权检查会在任何基于注解的授权检查之前执行，所以只有这两种检查都通过后请求才会被允许执行。这意味着如果使用 `quarkus.http.auth.` 配置阻止了一个路径，您就不能使用 `@PermitAll` 来开放该路径。如果您使用 JAX-RS，您可能需要考虑使用 `quarkus.security.jaxrs.deny-unannotated-endpoints` 或 `quarkus.security.jaxrs.default-roles-allowed` 来设置默认的安全要求，而不是基于HTTP 路径级别的匹配，因为这些属性可以被独立节点上的注解所覆盖。

source: Configuration for the Kafka connector outgoing channels is similar to that of incoming:
zh_cn: Kafka Connector中用于发送的 channels 的配置与用于接收的 channel 的配置类似：

source: Configuration key conflicts
zh_cn: 配置键冲突

source: Configure Redis hosts to connect to. Here we connect to the Redis server we started in the previous section
zh_cn: 配置要连接的Redis主机。这里我们连接到上一节中启动的Redis服务

source: Configure the Kafka bootstrap location, so the application connects to this broker.
zh_cn: 配置Kafka bootstrap位置，这样应用程序就会连接到这个broker。

source: Configure the OpenTelemetry Collector by creating an `otel-collector-config.yaml` file:
zh_cn: 通过创建一个 `otel-collector-config.yaml` 文件来配置OpenTelemetry Collector：

source: Configure the broker location for the production profile. You can configure it globally or per channel using `mp.messaging.incoming.$channel.bootstrap.servers` property. In dev mode and when running tests, <<kafka-dev-services>> automatically starts a Kafka broker. When not provided this property defaults to `localhost:9092`.
zh_cn: 请务必为生产环境配置broker地址。您可以在全局环境配置或使用 `mp.messaging.incoming.$channel.bootstrap.servers` 属性来针对特定channel配置。在开发模式和运行测试时， <<kafka-dev-services>>会自动启动一个Kafka broker。如果没有提供这个属性，则默认为 `localhost:9092` 。

source: Configure the broker location for the production profile. You can configure it globally or per channel using `mp.messaging.outgoing.$channel.bootstrap.servers` property. In dev mode and when running tests, <<kafka-dev-services>> automatically starts a Kafka broker. When not provided, this property defaults to `localhost:9092`.
zh_cn: 请配置生产环境的broker位置。您可以在全局配置，或使用 `mp.messaging.outgoing.$channel.bootstrap.servers` 来针对特定channel配置它。在开发模式和运行测试时， <<kafka-dev-services>>会自动启动一个Kafka broker。如果该属性未提供，它将默认为 `localhost:9092` 。

source: Configure the connector to manage the `prices-out` channel.
zh_cn: 配置connector来管理 `prices-out` channel。

source: Configure the connector to manage the prices channel. By default the topic name is same as the channel name. You can configure the topic attribute to override it.
zh_cn: 配置connector来管理prices channel。默认情况下，topic名称与channel名称相同。您可以通过配置topic属性来覆盖它。

source: Configure the default `datacontenttype` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `datacontenttype` attribute itself Type: _string_
zh_cn: 配置传出的云事件的默认 `datacontenttype` 属性。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `datacontenttype` 属性，则使用此值 类型: _string_

source: Configure the default `dataschema` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `dataschema` attribute itself Type: _string_
zh_cn: 配置传出的云事件的默认 `dataschema` 属性。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `dataschema` 属性，则使用此值 类型: _string_

source: Configure the default `source` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `source` attribute itself Type: _string_
zh_cn: 配置传出的云事件的默认 `source` 属性。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `source` 属性，则使用此值 类型: _string

source: Configure the default `subject` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `subject` attribute itself Type: _string_
zh_cn: 配置传出的云事件的默认 `subject` 属性。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `subject` 属性，则使用此值 类型: _string_

source: Configure the default `type` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `type` attribute itself Type: _string_
zh_cn: 配置传出的云事件的默认 `type` 属性。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `type` 属性，则使用此值 类型: _string_

source: Configure the runtime environment. Set `GRAALVM_HOME` environment variable to the GraalVM installation directory, for example:
zh_cn: 配置运行环境。将 `GRAALVM_HOME` 环境变量设置为GraalVM的安装目录，例如：

source: Configures the broker/router host name. You can do it per channel (using the `host` attribute) or globally using `amqp-host`
zh_cn: 配置代理/路由器的主机名。你可以按通道进行配置（使用 `host` 属性），或使用 `amqp-host` 进行全局配置

source: Configures the broker/router password if required. You can do it per channel (using the `password` attribute) or globally using `amqp-password`.
zh_cn: 如果需要，请配置代理/路由器的密码。你可以按通道（使用 `password` 属性）进行配置，或使用 `amqp-password` 进行全局配置。

source: Configures the broker/router port. You can do it per channel (using the `port` attribute) or globally using `amqp-port`. The default is `5672`.
zh_cn: 配置代理/路由器的端口。你可以按通道（使用 `port` 属性）进行配置，或使用 `amqp-port` 进行全局配置。默认是 `5672` 。

source: Configures the broker/router username if required. You can do it per channel (using the `username` attribute) or globally using `amqp-username`.
zh_cn: 如果需要，请配置代理/路由器的用户名。你可以按通道（使用 `username` 属性）进行配置，或使用 `amqp-username` 进行全局配置。

source: Configuring GraalVM
zh_cn: 配置GraalVM

source: Configuring JSON support
zh_cn: 配置JSON支持

source: Configuring Kafka topics
zh_cn: 配置Kafka主题

source: Configuring Keycloak programmatically
zh_cn: 以编程方式配置Keycloak

source: Configuring Logging
zh_cn: 配置日志

source: Configuring Redis properties
zh_cn: 配置Redis

source: Configuring Smallrye Kafka Connector
zh_cn: 配置Smallrye Kafka Connector

source: Configuring Well-Known OpenID Connect (OIDC) Providers
zh_cn: 配置知名的OpenID Connect（OIDC）提供者

source: Configuring Your Application
zh_cn: 配置你的应用程序

source: Configuring live reload compiler
zh_cn: 配置实时重载编译器

source: Configuring the AMQP Broker access
zh_cn: 配置AMQP代理访问

source: Configuring the AMQP address
zh_cn: 配置AMQP地址

source: Configuring the MongoDB database
zh_cn: 配置MongoDB数据库

source: Configuring the Native Executable
zh_cn: 配置原生可执行文件

source: Configuring the Vert.x instance
zh_cn: 配置Vert.x实例

source: Configuring the address
zh_cn: 配置地址

source: Configuring the application
zh_cn: 配置该应用程序

source: Configuring the banner
zh_cn: 配置banner

source: Configuring the image
zh_cn: 配置镜像

source: Configuring the incoming channel. This channel reads from Kafka.
zh_cn: 配置传入 channel 。该 channel 从Kafka读取消息。

source: Configuring the transaction timeout
zh_cn: 配置事务超时

source: Configuring the {extension-name} Extension Security Information
zh_cn: 配置{extension-name}扩展安全信息

source: Configuring transaction node name identifier
zh_cn: 配置事务节点名称标识符

source: Configuring your datasources
zh_cn: 配置你的数据源

source: Connecting to Managed Kafka clusters
zh_cn: 连接到受管理的Kafka集群

source: Connection Health Check
zh_cn: 连接健康检查

source: Connector auto-attachment
zh_cn: 连接器自动连接

source: Consul Client
zh_cn: Consul客户端

source: Consume Configuration from Consul
zh_cn: 从Consul中消费配置

source: Consume Configuration from Google Cloud Secret Manager
zh_cn: 从谷歌云秘密管理器中消费配置

source: Consumer Groups
zh_cn: 消费者组(Consumer Groups)

source: Consumer Rebalance Listener
zh_cn: 消费者再平衡监听器(Consumer Rebalance Listener)

source: Consuming GraphQL Services
zh_cn: 消费GraphQL服务

source: Consuming Kubernetes ConfigMaps
zh_cn: 消费Kubernetes ConfigMaps

source: Consuming gRPC Services
zh_cn: 消费gRPC服务

source: Container First
zh_cn: 容器优先

source: Context Propagation
zh_cn: 事务和安全上下文传播

source: Continuing from the previous minimal configuration, your Quarkus application can receive message payload directly:
zh_cn: 让我们继续刚才的最小配置。您的Quarkus应用程序可以直接接收消息payload：

source: Continuous Testing
zh_cn: 持续测试

source: Continuum
zh_cn: 连续统一体

source: Contributing
zh_cn: 贡献

source: Contributing to Dev UI
zh_cn: 为开发用户界面做出贡献

source: Contributing to the Quarkus.io website
zh_cn: 为Quarkus.io网站贡献力量

source: Contributions are welcome, please submit pull requests for the `develop` branch.
zh_cn: 欢迎贡献，请为 `develop` 分支提交pull requests。

source: Contributors
zh_cn: 贡献者

source: Controlling HTTP interaction timeout
zh_cn: 控制HTTP交互超时时间

source: Controlling the test port
zh_cn: 控制测试端口

source: Conversely, if the processing throws an exception, all messages are _nacked_, applying the failure strategy for all the records inside the batch.
zh_cn: 反之，如果处理过程抛出一个异常，所有的消息都_不会被确认(nacked)_ ，并且对批次中的所有记录应用失败策略。

source: Cool stuff right? <a href="https://quarkus.io/guides/maven-tooling#dev-mode">Learn more about Quarkus's dev mode</a>.
zh_cn: 很Cool的东东对吧？<a href="https://quarkus.io/guides/maven-tooling#dev-mode">了解更多Quarkus的开发模式</a>。

source: Copy the build.gradle, gradle.properties and settings.gradle into the above generated Maven archetype project, to follow along with this guide.
zh_cn: 将build.gradle、gradle.properties和settings.gradle复制到上述生成的Maven archetype项目中，以按照本指南进行操作。

source: Copy your current "Installed JRE" definition into a new one, where you will add the properties as a new VM arguments:
zh_cn: 将您当前的 "已安装的JRE "定义复制为一个新的定义，在这里您会将其作为新的虚拟机参数配置来添加属性：

source: Core
zh_cn: 核心

source: Coroutines support
zh_cn: Coroutines 支持

source: Counters
zh_cn: 计数器（Counters）

source: Counters are used to measure values that only increase. In the example below, you will count the number of times you test a number to see if it is prime:
zh_cn: Counters是用来测量只增加的数值的。在下面的例子中，您将统计您测试一个数字是否是质数的次数:

source: Create a Quarkus Test using the test resource created above:
zh_cn: 使用上面创建的测试资源创建一个Quarkus测试：

source: Create a REST endpoint in `src/main/java/org/acme/security/jwt/TokenSecuredResource.java` with the following content:
zh_cn: 在 `src/main/java/org/acme/security/jwt/TokenSecuredResource.java` 里，创建一个REST端点，内容如下:

source: Create a `security-jwt-quickstart/src/main/resources/application.properties` with the following content:
zh_cn: 创建一个 `security-jwt-quickstart/src/main/resources/application.properties` ，内容如下:

source: Create a `src/main/java/org/acme/opentelemetry/TracedResource.java` file with the following content:
zh_cn: 创建一个 `src/main/java/org/acme/opentelemetry/TracedResource.java` 文件，内容如下：

source: Create a native executable using:
zh_cn: 使用以下方法创建一个原生可执行文件：

source: Create a new class `src/main/java/org/acme/spring/boot/properties/GreetingProperties.java` with a message field:
zh_cn: 创建一个包含消息字段的 `src/main/java/org/acme/spring/boot/properties/GreetingProperties.java` 类:

source: Create an ECR repository in the users AWS account
zh_cn: 在用户的AWS账户中创建一个ECR存储库

source: Create an Execution Role
zh_cn: 创建一个执行角色

source: Create and debug applications in the same environment where applications run. Live coding in development mode where any changes made locally will be immediately visible in a clustered Kubernetes environment. <a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">Read this blog post for greater insight.</a>
zh_cn: 在应用程序运行的同一环境中创建和调试应用程序。在开发模式下的实时编码，在集群化的Kubernetes环境中，本地做出的任何更改都将立即可见。<a href="https://developers.redhat.com/blog/2021/02/11/enhancing-the-development-loop-with-quarkus-remote-development">阅读这篇博客可以获得更深刻的见解</a>

source: Create consumer task which subscribes to 'orders-processed' topic and consumes 10 records.
zh_cn: 创建消费者任务，用来订阅'orders-processed'topic并消费10条记录。

source: Create inside the `producer` project `src/main/resources/META-INF/resources/quotes.html` file, with the following content:
zh_cn: 在 `producer` 项目中创建 `src/main/resources/META-INF/resources/quotes.html` 文件，内容如下：

source: Create projects, manage extensions, and execute essential build and dev commands.
zh_cn: 创建项目，管理扩展，并执行基本的构建和开发命令。

source: Create the AWS lambda function with the AWS CLI tool
zh_cn: 用AWS CLI工具创建AWS lambda函数

source: Create the Getting Started Application
zh_cn: 创建 "入门 "应用程序

source: Create the Quarkus AWS Lambda Maven project using our Maven Archetype.
zh_cn: 使用我们的Maven 原型创建Quarkus AWS Lambda Maven项目。
